AlexGyver/GyverCore/GyverCore/boards.txt
## See: http://code.google.com/p/arduino/wiki/Platforms
## почему у оптибута неправильно стоят фьюзы? https://github.com/arduino/ArduinoCore-avr/issues/10
## optiboot v4

menu.clock=Clock
menu.timers=System timer

########################
## 328 old bootloader ##
########################
nanoOld.name=ATmega328 (old bootloader)
nanoOld.upload.tool=avrdude
nanoOld.upload.protocol=arduino
nanoOld.bootloader.tool=avrdude
nanoOld.bootloader.unlock_bits=0x3F
nanoOld.bootloader.lock_bits=0x0F
nanoOld.build.board=AVR_NANO
nanoOld.build.core=arduino

nanoOld.upload.maximum_size=30720
nanoOld.upload.maximum_data_size=2048
nanoOld.upload.speed=57600
nanoOld.bootloader.high_fuses=0xDA
nanoOld.bootloader.extended_fuses=0xFD
nanoOld.build.mcu=atmega328p

nanoOld.menu.clock.external_16=External 16 MHz
nanoOld.menu.clock.external_16.bootloader.low_fuses=0xFF
nanoOld.menu.clock.external_16.build.f_cpu=16000000L
nanoOld.menu.clock.external_16.bootloader.file=atmega/ATmegaBOOT_168_atmega328.hex

nanoOld.menu.clock.external_8=External 8 MHz
nanoOld.menu.clock.external_8.bootloader.low_fuses=0xFF
nanoOld.menu.clock.external_8.build.f_cpu=8000000L
nanoOld.menu.clock.external_8.bootloader.file=atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex

nanoOld.menu.clock.internal_8=Internal 8 MHz
nanoOld.menu.clock.internal_8.bootloader.low_fuses=0xD2
nanoOld.menu.clock.internal_8.build.f_cpu=8000000L
nanoOld.menu.clock.internal_8.bootloader.file=atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex

nanoOld.menu.timers.yes_millis=millis enabled
nanoOld.menu.timers.yes_millis.build.variant=yesmillis
nanoOld.menu.timers.no_millis=millis disabled
nanoOld.menu.timers.no_millis.build.variant=nomillis


##################
## 328 optiBoot ##
##################
nanoOpti.name=ATmega328 (optiboot)
nanoOpti.upload.tool=avrdude
nanoOpti.upload.protocol=arduino
nanoOpti.bootloader.tool=avrdude
nanoOpti.bootloader.unlock_bits=0x3F
nanoOpti.bootloader.lock_bits=0x0F
nanoOpti.build.board=AVR_NANO
nanoOpti.build.core=arduino

nanoOpti.upload.maximum_size=30720
nanoOpti.upload.maximum_data_size=2048
nanoOpti.upload.speed=115200
nanoOpti.bootloader.high_fuses=0xDA
nanoOpti.bootloader.extended_fuses=0xFD
nanoOpti.build.mcu=atmega328p

nanoOpti.menu.clock.external_16=External 16 MHz
nanoOpti.menu.clock.external_16.bootloader.low_fuses=0xFF
nanoOpti.menu.clock.external_16.build.f_cpu=16000000L
nanoOpti.menu.clock.external_16.bootloader.file=optiboot/optiboot_atmega328.hex

nanoOpti.menu.clock.external_8=External 8 MHz
nanoOpti.menu.clock.external_8.bootloader.low_fuses=0xFF
nanoOpti.menu.clock.external_8.build.f_cpu=8000000L
nanoOpti.menu.clock.external_8.bootloader.file=optiboot/optiboot_atmega328_pro_8MHz.hex

nanoOpti.menu.clock.internal_8=Internal 8 MHz
nanoOpti.menu.clock.internal_8.bootloader.low_fuses=0xD2
nanoOpti.menu.clock.internal_8.build.f_cpu=8000000L
nanoOpti.menu.clock.internal_8.bootloader.file=optiboot/optiboot_atmega328_pro_8MHz.hex

nanoOpti.menu.timers.yes_millis=millis enabled
nanoOpti.menu.timers.yes_millis.build.variant=yesmillis
nanoOpti.menu.timers.no_millis=millis disabled
nanoOpti.menu.timers.no_millis.build.variant=nomillis

#######################
## 328 no bootloader ##
#######################
nanoWB.name=ATmega328 (without bootloader)
nanoWB.upload.tool=avrdude
nanoWB.upload.protocol=arduino
nanoWB.bootloader.tool=avrdude
nanoWB.bootloader.unlock_bits=0x3F
nanoWB.bootloader.lock_bits=0x0F
nanoWB.build.board=AVR_NANO
nanoWB.build.core=arduino

nanoWB.upload.maximum_size=32768
nanoWB.upload.maximum_data_size=2048
nanoWB.bootloader.high_fuses=0xDF
nanoWB.bootloader.extended_fuses=0xFD
nanoWB.build.mcu=atmega328p

nanoWB.menu.clock.external_16=External 16 MHz
nanoWB.menu.clock.external_16.bootloader.low_fuses=0xFF
nanoWB.menu.clock.external_16.build.f_cpu=16000000L
nanoWB.menu.clock.external_16.bootloader.file=atmega/ATmegaBOOT_168_atmega328.hex

nanoWB.menu.clock.external_8=External 8 MHz
nanoWB.menu.clock.external_8.bootloader.low_fuses=0xFF
nanoWB.menu.clock.external_8.build.f_cpu=8000000L
nanoWB.menu.clock.external_8.bootloader.file=atmega/ATmegaBOOT_168_atmega328.hex

nanoWB.menu.clock.internal_8=Internal 8 MHz
nanoWB.menu.clock.internal_8.bootloader.low_fuses=0xD2
nanoWB.menu.clock.internal_8.build.f_cpu=8000000L
nanoWB.menu.clock.internal_8.bootloader.file=atmega/ATmegaBOOT_168_atmega328.hex

nanoWB.menu.clock.internal_1=Internal 1 MHz
nanoWB.menu.clock.internal_1.bootloader.low_fuses=0x52
nanoWB.menu.clock.internal_1.build.f_cpu=1000000L
nanoWB.menu.clock.internal_1.bootloader.file=atmega/ATmegaBOOT_168_atmega328.hex

nanoWB.menu.clock.internal_128=Internal 128 kHz
nanoWB.menu.clock.internal_128.bootloader.low_fuses=0xD3
nanoWB.menu.clock.internal_128.build.f_cpu=128000L
nanoWB.menu.clock.internal_128.bootloader.file=atmega/ATmegaBOOT_168_atmega328.hex

nanoWB.menu.timers.yes_millis=millis enabled
nanoWB.menu.timers.yes_millis.build.variant=yesmillis
nanoWB.menu.timers.no_millis=millis disabled
nanoWB.menu.timers.no_millis.build.variant=nomillis